In [1]:
import pandas as pd

In [2]:
data_2017 = pd.read_csv('2017_ll2017.csv')

In [3]:
data_2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 74 entries, 0 to 73
Data columns (total 10 columns):
Dte.                      74 non-null object
Barris                    73 non-null object
1r Trimestre              74 non-null object
2n Trimestre              74 non-null object
3r Trimestre              74 non-null object
4rt Trimestre             74 non-null object
Acumulat/1r Trimestre     74 non-null object
Acumulat/2n Trimestre     74 non-null object
Acumulat/3r Trimestre     74 non-null object
Acumulat/4rt Trimestre    74 non-null object
dtypes: object(10)
memory usage: 5.9+ KB

In [4]:
data_2017.head()

,Dte.,Barris,1r Trimestre,2n Trimestre,3r Trimestre,4rt Trimestre,Acumulat/1r Trimestre,Acumulat/2n Trimestre,Acumulat/3r Trimestre,Acumulat/4rt Trimestre
0,BARCELONA,NaN,845.15,864.98,903.40,889.58,845.15,855.46,872.57,877.28
1,1,1. el Raval,734.99,714.29,764.85,776.73,734.99,724.60,737.93,748.58
2,1,2. el Barri Gòtic,905.26,968.16,1028.49,993.16,905.26,936.40,966.06,973.27
3,1,3. la Barceloneta,722.78,738.25,758.18,766.03,722.78,730.86,739.29,745.81
4,1,"4. Sant Pere, Santa Caterina i la Ribera",895.28,930.13,927.16,914.78,895.28,912.84,917.40,916.65

In [6]:
data_2017.columns

Index(['Dte.', 'Barris', '1r Trimestre', '2n Trimestre', '3r Trimestre',
       '4rt Trimestre', 'Acumulat/1r Trimestre', 'Acumulat/2n Trimestre',
       'Acumulat/3r Trimestre', 'Acumulat/4rt Trimestre'],
      dtype='object')

In [9]:
data_2017.drop(columns = {'Barris', '1r Trimestre','2n Trimestre', '3r Trimestre', 
                          '4rt Trimestre' , 'Acumulat/1r Trimestre' , 'Acumulat/2n Trimestre', 
                          'Acumulat/3r Trimestre' }, inplace = True)

In [11]:
data_2017.head()

        Dte. Acumulat/4rt Trimestre
0  BARCELONA                 877.28
1          1                 748.58
2          1                 973.27
3          1                 745.81
4          1                 916.65

In [12]:
data_2017.drop({0}, inplace = True)

In [24]:
data_2017.head()

  Dte. Acumulat/4rt Trimestre
1    1                 748.58
2    1                 973.27
3    1                 745.81
4    1                 916.65
5    2                 900.42

In [29]:
data_2017['Acumulat/4rt Trimestre'] = data_2017['Acumulat/4rt Trimestre'].replace('-', value = None)

In [30]:
data_2017['Acumulat/4rt Trimestre'] = data_2017['Acumulat/4rt Trimestre'].astype({'Acumulat/4rt Trimestre' : 'float64'})

In [15]:
data_2017.groupby(['Dte.']).sum()

                                 Acumulat/4rt Trimestre
Dte.
1                              748.58973.27745.81916.65
10    778.14767.51893.671259.70900.221092.06613.0393...
2                900.42876.251195.231060.03943.23900.48
3           749.52-691.42811.08747.09789.98759.18787.23
4                                  1002.47925.161785.63
5             1220.001353.861634.121236.681311.47930.19
6                        910.93724.94799.97860.63864.07
7     770.94686.96736.91817.10603.34648.90674.67724....
8     714.83662.04615.50417.84650.05680.56533.39591....
9            497.60458.37627.45733.94667.56730.84777.64